# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..Name Property
AssetProperty Class See Also
---
Get the name of the AssetProperty
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace